#!/usr/bin/python3
import os,sys,unicodedata

#=======================
# 20140130
# Testing character counts
#=======================

#a = chr(6016)
#print('a = ')
#print(a)
#print('unicodedata.name = ')
#print(unicodedata.name(a))

s = 'ទំព័រដើមកម្សាន្តព័ត៌មានកម្សាន្តតន្ត្រីចម្រៀងពេញនិយមភាពយន្តវីដេអូតារាទស្សនាចរតាក់តែងម៉ូដជុំវិញបច្ចេកវិទ្យាព័ត៌មានបច្ចេកវិទ្យាផលិតផលថ្មីគន្លឹះខ្លីៗស្វែងយល់ផលិតផលស្វែងយល់ពីទស្សនៈខ្ញុំបណ្តុំប្រវត្តិបច្ចេកវិទ្យាហ្គេមអនឡាញសទ្ទានុក្រមជីវិតនិងសង្គមព័ត៌មានសង្គមអប់រំនិងការងារដឹងចរាចរណ៍ស្រុកយើងស្នេហានិងទំនាក់ទំនងស្នេហ៍ខ្ញុំសុខភាពនិងសម្រស់រសជីវិតអាហារកីឡាព័ត៌មានកីឡាវិភាគកីឡាកម្មវិធីប្រកួតលទ្ធផលខ្ញុំនិងកីឡាប្រវត្តិកីឡានិពន្ធនាយករូបភាពស្មៅទីលានពហុកីឡដ្ឋានជាតិស្ទើររកពេលងើបមិនរួចនាដើមឆ្នាំ២០១៤នេះស្មៅនៅលើទីលានពហុកីឡដ្ឋានជាតិកណ្ដាលរាជធានីភ្នំពេញស្ទើរតែរកពេលលូតលាស់មិនទាន់ដោយសារកម្មវិធីប្រកួតអានបន្តប្រើពេល១១ឆ្នាំសន្សំសក់បាន១១៦០៥៨សរសៃច្នៃធ្វើអាវនិងមួកបានយ៉ាងស្អាតអ្នកស្រីរស់នៅខេត្តបានសន្សំសក់របស់គាត់ប្រមាណជា១១៦០៥៨សរសៃអានបន្តគួរដាក់លុយក្នុងអាំងប៉ាវប៉ុន្មានឲ្យត្រូវហុងស៊ុយតាមក្បួនចិនប្រិយមិត្តក៏អាចដាក់លុយត្រឹមចំនួន២ដុល្លារ៤ដុល្លារ៦ដុល្លារឬ៨ដុល្លារផងដែរព្រោះចំនួនទាំងអស់នេះសុទ្ធតែ'
print(s)
print ('Ka = ', s.count(chr(6016)))
print ('Kha = ', s.count(chr(6017)))
for i in range(6016, 6051): 
#for i in range(6016, 6121): All khmer characters
    character =chr(i)
    print (chr(i), '\t', s.count(chr(i)))
    


    
